profiling/stage_4/put_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.962ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.130ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.100ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93ms  294.63us   2.11ms   58.88%
    Req/Sec   206.05     76.89   400.00     49.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.18ms
 90.000%    1.34ms
 99.000%    1.47ms
 99.900%    1.64ms
 99.990%    1.85ms
 99.999%    2.11ms
100.000%    2.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.318     0.000000            1         1.00
       0.531     0.100000         1473         1.11
       0.629     0.200000         2926         1.25
       0.732     0.300000         4394         1.43
       0.832     0.400000         5858         1.67
       0.933     0.500000         7330         2.00
       0.982     0.550000         8043         2.22
       1.032     0.600000         8773         2.50
       1.083     0.650000         9505         2.86
       1.134     0.700000        10242         3.33
       1.184     0.750000        10977         4.00
       1.209     0.775000        11354         4.44
       1.232     0.800000        11698         5.00
       1.257     0.825000        12074         5.71
       1.282     0.850000        12429         6.67
       1.306     0.875000        12798         8.00
       1.321     0.887500        12977         8.89
       1.337     0.900000        13160        10.00
       1.351     0.912500        13352        11.43
       1.364     0.925000        13530        13.33
       1.380     0.937500        13708        16.00
       1.389     0.943750        13812        17.78
       1.397     0.950000        13892        20.00
       1.404     0.956250        13984        22.86
       1.414     0.962500        14075        26.67
       1.423     0.968750        14168        32.00
       1.429     0.971875        14219        35.56
       1.433     0.975000        14257        40.00
       1.440     0.978125        14309        45.71
       1.444     0.981250        14350        53.33
       1.451     0.984375        14405        64.00
       1.454     0.985938        14418        71.11
       1.458     0.987500        14442        80.00
       1.463     0.989062        14464        91.43
       1.469     0.990625        14489       106.67
       1.474     0.992188        14508       128.00
       1.481     0.992969        14524       142.22
       1.484     0.993750        14530       160.00
       1.492     0.994531        14544       182.86
       1.497     0.995313        14553       213.33
       1.513     0.996094        14565       256.00
       1.522     0.996484        14570       284.44
       1.531     0.996875        14577       320.00
       1.558     0.997266        14582       365.71
       1.578     0.997656        14587       426.67
       1.592     0.998047        14593       512.00
       1.601     0.998242        14596       568.89
       1.608     0.998437        14599       640.00
       1.623     0.998633        14602       731.43
       1.641     0.998828        14604       853.33
       1.653     0.999023        14607      1024.00
       1.663     0.999121        14609      1137.78
       1.672     0.999219        14610      1280.00
       1.684     0.999316        14612      1462.86
       1.732     0.999414        14613      1706.67
       1.740     0.999512        14614      2048.00
       1.746     0.999561        14615      2275.56
       1.747     0.999609        14616      2560.00
       1.762     0.999658        14617      2925.71
       1.762     0.999707        14617      3413.33
       1.767     0.999756        14618      4096.00
       1.767     0.999780        14618      4551.11
       1.800     0.999805        14619      5120.00
       1.800     0.999829        14619      5851.43
       1.800     0.999854        14619      6826.67
       1.853     0.999878        14620      8192.00
       1.853     0.999890        14620      9102.22
       1.853     0.999902        14620     10240.00
       1.853     0.999915        14620     11702.86
       1.853     0.999927        14620     13653.33
       2.111     0.999939        14621     16384.00
       2.111     1.000000        14621          inf
#[Mean    =        0.934, StdDeviation   =        0.295]
#[Max     =        2.110, Total count    =        14621]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  37637 requests in 30.00s, 2.98MB read
  Socket errors: connect 7, read 0, write 0, timeout 14081
Requests/sec:   1254.61
Transfer/sec:    101.58KB