profiling/stage_4/put_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.038ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.024ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.068ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.068ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97ms  358.72us  17.22ms   69.91%
    Req/Sec     1.68k   498.96     2.89k    70.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95ms
 75.000%    1.21ms
 90.000%    1.37ms
 99.000%    1.56ms
 99.900%    3.72ms
 99.990%    9.09ms
 99.999%   17.07ms
100.000%   17.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.293     0.000000            1         1.00
       0.548     0.100000        11969         1.11
       0.649     0.200000        23791         1.25
       0.754     0.300000        35783         1.43
       0.851     0.400000        47659         1.67
       0.952     0.500000        59481         2.00
       1.002     0.550000        65509         2.22
       1.052     0.600000        71360         2.50
       1.104     0.650000        77346         2.86
       1.157     0.700000        83242         3.33
       1.214     0.750000        89200         4.00
       1.241     0.775000        92164         4.44
       1.268     0.800000        95170         5.00
       1.294     0.825000        98194         5.71
       1.319     0.850000       101143         6.67
       1.344     0.875000       104057         8.00
       1.357     0.887500       105602         8.89
       1.370     0.900000       107034        10.00
       1.385     0.912500       108586        11.43
       1.400     0.925000       110096        13.33
       1.417     0.937500       111486        16.00
       1.427     0.943750       112294        17.78
       1.437     0.950000       113034        20.00
       1.447     0.956250       113723        22.86
       1.459     0.962500       114493        26.67
       1.472     0.968750       115254        32.00
       1.479     0.971875       115612        35.56
       1.486     0.975000       115971        40.00
       1.494     0.978125       116349        45.71
       1.504     0.981250       116703        53.33
       1.517     0.984375       117070        64.00
       1.525     0.985938       117251        71.11
       1.536     0.987500       117442        80.00
       1.550     0.989062       117618        91.43
       1.571     0.990625       117815       106.67
       1.604     0.992188       117990       128.00
       1.628     0.992969       118082       142.22
       1.658     0.993750       118174       160.00
       1.695     0.994531       118269       182.86
       1.761     0.995313       118359       213.33
       1.891     0.996094       118452       256.00
       1.980     0.996484       118498       284.44
       2.137     0.996875       118546       320.00
       2.303     0.997266       118591       365.71
       2.467     0.997656       118639       426.67
       2.777     0.998047       118684       512.00
       2.969     0.998242       118707       568.89
       3.141     0.998437       118731       640.00
       3.359     0.998633       118754       731.43
       3.575     0.998828       118777       853.33
       3.735     0.999023       118800      1024.00
       3.855     0.999121       118812      1137.78
       4.007     0.999219       118824      1280.00
       4.207     0.999316       118835      1462.86
       4.475     0.999414       118848      1706.67
       4.687     0.999512       118858      2048.00
       4.847     0.999561       118864      2275.56
       5.055     0.999609       118870      2560.00
       5.331     0.999658       118876      2925.71
       5.815     0.999707       118882      3413.33
       6.167     0.999756       118887      4096.00
       6.503     0.999780       118890      4551.11
       6.951     0.999805       118893      5120.00
       7.223     0.999829       118896      5851.43
       7.511     0.999854       118899      6826.67
       8.527     0.999878       118902      8192.00
       8.631     0.999890       118903      9102.22
       9.247     0.999902       118905     10240.00
       9.303     0.999915       118907     11702.86
       9.343     0.999927       118908     13653.33
       9.479     0.999939       118909     16384.00
       9.895     0.999945       118910     18204.44
      10.239     0.999951       118911     20480.00
      10.239     0.999957       118911     23405.71
      10.719     0.999963       118912     27306.67
      14.983     0.999969       118913     32768.00
      14.983     0.999973       118913     36408.89
      16.639     0.999976       118914     40960.00
      16.639     0.999979       118914     46811.43
      16.639     0.999982       118914     54613.33
      17.071     0.999985       118915     65536.00
      17.071     0.999986       118915     72817.78
      17.071     0.999988       118915     81920.00
      17.071     0.999989       118915     93622.86
      17.071     0.999991       118915    109226.67
      17.231     0.999992       118916    131072.00
      17.231     1.000000       118916          inf
#[Mean    =        0.965, StdDeviation   =        0.359]
#[Max     =       17.216, Total count    =       118916]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  207293 requests in 30.00s, 16.41MB read
  Socket errors: connect 7, read 0, write 0, timeout 13300
  Non-2xx or 3xx responses: 38
Requests/sec:   6910.05
Transfer/sec:    559.99KB